/*
*) 입력
각 테스트 케이스의 첫째 줄에는 가게에 있는 사탕 종류의 수 n과 상근이가 가지고 있는 돈의 양 m이 주어진다.
(1 ≤ n ≤ 5,000, 0.01 ≤ m ≤ 100.00) m은 항상 소수점 둘째자리까지 주어진다.
다음 n개 줄에는 각 사탕의 칼로리 c와 가격 p가 주어진다.
(1 ≤ c ≤ 5,000, 0.01 ≤ p ≤ 100.00) c는 항상 정수, p는 항상 소수점 둘째자리이다.
입력의 마지막 줄에는 '0 0.00'이 주어진다.

예제 입력 1 
2 8.00
700 7.00
199 2.00
3 8.00
700 7.00
299 3.00
499 5.00
0 0.00

1 5.00
200 1.00

*) 메모리

*) 시나리오


*) 출력

(1) cout <<"prc :"<<prc<<",idx:"<<idx<<endl;
(2) cout <<"return"<<mp[idx][0]<<", prc :"<<prc<<",idx:"<<idx<<endl;
(3) cout <<"return 0; prc :"<<prc<<",idx:"<<idx<<endl;
*/